АлогистикТест2/src/Documents/алк_РапортПропарка/алк_РапортПропарка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РапортПропарка</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиКамерыГТО</registerRecords>
  <registerRecords>InformationRegister.алк_ВремяПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ОперацииПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пропарщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Камеры</name>
    <attributes>
      <name>КамераСсылка</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаНаНачало</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаНаКонец</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаНаНачало</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаНаКонец</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрНаНачало</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрНаКонец</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияНаНачало</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияНаКонец</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНаНачало</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНаКонец</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаНачалоСмены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузкиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузкиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РазгрузилиОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузкиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузкиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрузкаОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПропарки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропарки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропаркиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропаркиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаКонецСмены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаДляДвижений</name>
    <attributes>
      <name>Камера</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Бригада</name>
      <type>
        <types>CatalogRef.алк_СменыШпон</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОжидаемое</name>
      <comment>Для контроля состояния камеры при записо документа</comment>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПериодыСезоновПропарки/алк_ПериодыСезоновПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПериодыСезоновПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </resources>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_НормативыПропарки/алк_НормативыПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_НормативыПропарки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НормативПропарки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Градация</name>
    <type>
      <types>CatalogRef.алк_ГрадацияПропарки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сезон</name>
    <type>
      <types>EnumRef.алк_СезоныПропарки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/Смены/Смены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Смены</name>
  <enumValues>
    <name>смена_8_20</name>
  </enumValues>
  <enumValues>
    <name>смена_20_8</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ОперацииПропарки/алк_ОперацииПропарки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперацииПропарки</name>
  <enumValues>
    <name>Загрузка</name>
  </enumValues>
  <enumValues>
    <name>Выгрузка</name>
  </enumValues>
  <enumValues>
    <name>Пропарка</name>
  </enumValues>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>Готова</name>
  </enumValues>
  <enumValues>
    <name>Обслуживание</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_РапортПропарка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	Если НЕ Параметры.ЗначениеКопирования.Пустая() Тогда 
		Сообщить("Копирование запрещено!");
        Отказ = Истина; СтандартнаяОбработка = Ложь;
	КонецЕсли; 
	
	УчастокПриИзмененииНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТаблицы = Объект.Камеры.НайтиПоИдентификатору(Элементы.Камеры.ТекущаяСтрока);
	
	ИмяКолонки = СтрЗаменить(Элемент.Имя, "Камеры",""); 
	
	ДатаВремя = СтрокаТаблицы[ИмяКолонки]; 
	
	Если Не ЗначениеЗаполнено(ДатаВремя) Тогда  	
		ДатаВремя = НачалоДня(Объект.ДатаСмены);
	КонецЕсли;
	
	ВызовФормыВремени(ДатаВремя, ИмяКолонки);  
	
КонецПроцедуры

//&НаКлиенте
//Процедура НачалоОперацииПриИзменении(Элемент)
//	ПараметрыВремени = Новый Структура;
//	ПараметрыВремени.Вставить("ИмяРеквизита", "НачалоОперации"); 

//	ВводВремениЗавершено(Объект.НачалоОперации, ПараметрыВремени);
//КонецПроцедуры

//&НаКлиенте
//Процедура ОкончаниеОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;	
//	ВызовФормыВремени(Объект.НачалоОперации, "ОкончаниеОперации");
//КонецПроцедуры

//&НаКлиенте
//Процедура ОкончаниеОперацииПриИзменении(Элемент)
//	ПараметрыВремени = Новый Структура;
//	ПараметрыВремени.Вставить("ИмяРеквизита", "ОкончаниеОперации"); 

//	ВводВремениЗавершено(Объект.ОкончаниеОперации, ПараметрыВремени);
//КонецПроцедуры


&НаКлиенте
Процедура ВызовФормыВремени(ДатаВремя, ИмяРеквизита)
	
	ПараметрыВремени = Новый Структура;
	ПараметрыВремени.Вставить("ДатаВремя", ДатаВремя);
	ПараметрыВремени.Вставить("ИмяРеквизита", ИмяРеквизита);

	ОписаниеОповещения = Новый ОписаниеОповещения("ВводВремениЗавершено", ЭтотОбъект, ПараметрыВремени);
	                                                // форма,  			   	Параметры, Владелец,      Уникальность      Окно НавигационнаяСсылка      
	ОткрытьФорму("Документ.алк_РапортПропарка.Форма.ФормаВводаВремени", ПараметрыВремени, ЭтаФорма,УникальныйИдентификатор,    , 					, ОписаниеОповещения,);
		
КонецПроцедуры

&НаКлиенте
Процедура ВводВремениЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;	
	КонецЕсли;    
			
	Если ДополнительныеПараметры.Свойство("ИмяРеквизита") Тогда
		
		СтрокаТаблицы = Объект.Камеры.НайтиПоИдентификатору(Элементы.Камеры.ТекущаяСтрока);		
		СтрокаТаблицы[ДополнительныеПараметры.ИмяРеквизита] = РезультатЗакрытия; 
		
		Если ДополнительныеПараметры.ИмяРеквизита = "НачалоПропарки" Тогда 		
			ЗаполнитьНормативПропарки();	
		КонецЕсли;  
		
		Если ДополнительныеПараметры.ИмяРеквизита = "НачалоЗагрузки" Тогда 		
			ЗаполнитьНормативЗагрузки();	
		КонецЕсли;
		
		Если ДополнительныеПараметры.ИмяРеквизита = "НачалоРазгрузки" Тогда 		
			ЗаполнитьНормативРазгрузки();	
		КонецЕсли;
		
	КонецЕсли;   
	
	РассчитатьПериодыОпераций();
	
	Модифицированность = Истина;
	
КонецПроцедуры // ВызовФормыВремени()

&НаСервере
Процедура ЗаполнитьПоПрошломуДокументуНаСервере()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 8
		|	алк_РапортПропаркаКамеры.КамераСсылка КАК КамераСсылка,
		|	алк_РапортПропаркаКамеры.ДлинаНаКонец КАК ДлинаНаНачало,
		|	алк_РапортПропаркаКамеры.ПородаНаКонец КАК ПородаНаНачало,
		|	алк_РапортПропаркаКамеры.СотрНаКонец КАК СотрНаНачало,
		|	алк_РапортПропаркаКамеры.ГрадацияНаКонец КАК ГрадацияНаНачало,
		|	алк_РапортПропаркаКамеры.СостояниеНаКонец КАК СостояниеНаНачало,
		|	алк_РапортПропаркаКамеры.ОстатокНаКонецСмены КАК ОстатокНаНачалоСмены,
		|	алк_РапортПропаркаКамеры.ОкончаниеПропаркиПланНаСледующуюСмену КАК ОкончаниеПропаркиПлан,
		|	алк_РапортПропаркаКамеры.ОкончаниеРазгрузкиПланНаСледующуюСмену КАК ОкончаниеРазгрузкиПлан,
		|	алк_РапортПропаркаКамеры.ОкончаниеЗазрузкиПланНаСледующуюСмену КАК ОкончаниеЗазрузкиПлан,
		|	алк_РапортПропаркаКамеры.ОстатокНаКонецСмены
		|ИЗ
		|	Документ.алк_РапортПропарка.Камеры КАК алк_РапортПропаркаКамеры
		|ГДЕ
		|	алк_РапортПропаркаКамеры.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_РапортПропаркаКамеры.Ссылка.Дата УБЫВ,
		|	алк_РапортПропаркаКамеры.НомерСтроки";
			
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_Штабели.Ссылка как КамераСсылка
		|ИЗ
		|	Справочник.алк_Штабели КАК алк_Штабели
		|ГДЕ
		|	алк_Штабели.Владелец.Ссылка = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.УчастокГТО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_Штабели.Наименование";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
	КонецЕсли;	
	
	Объект.Камеры.Очистить();
	
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
					
			НоваяСтрока = Объект.Камеры.Добавить();			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);  
			
			// проверяем нормативное время окончание пропарки - возможно пропарка буте всю смену и нужно 
			// перенести на следующую смену
			
			ОкончаниеПропаркиПлан = НоваяСтрока.ОкончаниеПропаркиПлан;    
			
			НачалоТекущейСмены = Объект.ДатаСмены + (Объект.Смена.НачалоСмены - Дата(1,1,1)) + ?(Объект.Смена.СменаПрошлыхСуток, 24*3600, 0);
			
			Если Объект.Смена.НачалоСмены < Объект.Смена.КонецСмены Тогда 			
				ПродолжительностьСмены = Объект.Смена.КонецСмены - Объект.Смена.НачалоСмены; 		
			Иначе 			
				ПродолжительностьСмены = Объект.Смена.НачалоСмены - Объект.Смена.КонецСмены - 2;		
			КонецЕсли;  		
			
			ОкончаниеТекущейСмены = НачалоТекущейСмены + ПродолжительностьСмены;
			
			Если ОкончаниеПропаркиПлан > ОкончаниеТекущейСмены Тогда   
				// будущая смена 
				
				НоваяСтрока.ОкончаниеПропаркиПланНаСледующуюСмену = ОкончаниеПропаркиПлан;
				НоваяСтрока.ОкончаниеПропаркиПлан = '00010101'; 
				НоваяСтрока.СостояниеНаКонец = НоваяСтрока.СостояниеНаНачало;	
				
			КонецЕсли; 

			
	КонецЦикла; 


КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПрошломуДокументу(Команда)	

	Если Не ЗначениеЗаполнено(Объект.ДатаСмены) Или Не ЗначениеЗаполнено(Объект.Смена) Тогда 	
		Сообщить("Требуется заполнить дату смены и смену!");		
		Возврат;	
	КонецЕсли;	
			
	Если Объект.Камеры.Количество() > 0 Тогда	
		Оповещение = Новый ОписаниеОповещения("ОповещениеВопросОчисткиТЧ", ЭтотОбъект);	 
   		ПоказатьВопрос(Оповещение,"Табличная часть будет очищена! Продолжить?", РежимДиалогаВопрос.ДаНет);    
	Иначе
		ЗаполнитьПоПрошломуДокументуНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросОчисткиТЧ(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        ЗаполнитьПоПрошломуДокументуНаСервере();
    КонецЕсли;	
 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНаКонецНаСервере()
	
	Для каждого Стр Из Объект.Камеры Цикл 
		
		Стр.ДлинаНаКонец 	= Стр.ДлинаНаНачало; 
		Стр.ПородаНаКонец 	= Стр.ПородаНаНачало; 
		Стр.СотрНаКонец 	= Стр.СотрНаНачало;
		Стр.ГрадацияНаКонец = Стр.ГрадацияНаНачало;	
		
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыНаКонец(Команда)
	ЗаполнитьПараметрыНаКонецНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КамерыГрадацияНаКонецПриИзменении(Элемент)
	
	ЗаполнитьНормативПропарки();	
	
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьНормативПропарки() 
	
	ГрадацииДокумента = Объект.Камеры.Выгрузить(,"ГрадацияНаКонец").ВыгрузитьКолонку("ГрадацияНаКонец");
	   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
		|ПОМЕСТИТЬ ВТ_Сезон
		|ИЗ
		|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.Градация,
		|	алк_НормативыПропаркиСрезПоследних.Порода,
		|	алк_НормативыПропаркиСрезПоследних.Сезон,
		|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(
		|			&ДатаСреза,
		|			Градация В (&ГрадацииДокумента)
		|				И Сезон В
		|					(ВЫБРАТЬ
		|						ВТ_Сезон.Сезон
		|					ИЗ
		|						ВТ_Сезон КАК ВТ_Сезон)) КАК алк_НормативыПропаркиСрезПоследних";
	
	Запрос.УстановитьПараметр("ГрадацииДокумента", ГрадацииДокумента);
	Запрос.УстановитьПараметр("ДатаСреза", Объект.ДатаСмены);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого Стр Из Объект.Камеры Цикл 
		
		ГрадацияКамеры 	= Стр.ГрадацияНаКонец;
		ПородаКамеры 	= Стр.ПородаНаКонец;
		
		ОтборГрадация = Новый Структура;
		ОтборГрадация.Вставить("Градация", 	ГрадацияКамеры);
		ОтборГрадация.Вставить("Порода", 	ПородаКамеры);
		
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(ОтборГрадация);	
		
		Если НайденныеСтроки.Количество() > 0 Тогда  
			
			Если ЗначениеЗаполнено(Стр.НачалоПропарки) Тогда 			
				
				ОкончаниеПропаркиПлан = Стр.НачалоПропарки + НайденныеСтроки[0].НормативПропарки * 3600;    
				
				НачалоТекущейСмены = Объект.ДатаСмены + ?(Объект.Смена = Перечисления.Смены.смена_8_20, 8*3600, 20*3600);
				ОкончаниеТекущейСмены = НачалоТекущейСмены + (12*3600 - 1);
				
				Если ОкончаниеПропаркиПлан < ОкончаниеТекущейСмены Тогда   
					// текущая смена  
					
					// не меняем если пропарка идет с прошлой смены
					// для исключения затирания по ошибке
					Если Не Стр.СостояниеНаНачало = Перечисления.алк_ОперацииПропарки.Пропарка Тогда
						Стр.ОкончаниеПропаркиПлан = ОкончаниеПропаркиПлан;
						Стр.ОкончаниеПропаркиПланНаСледующуюСмену = '00010101';				
					КонецЕсли;
					
				Иначе 
					// будущая смена
					Стр.ОкончаниеПропаркиПлан = '00010101';
					Стр.ОкончаниеПропаркиПланНаСледующуюСмену = ОкончаниеПропаркиПлан;
				КонецЕсли; 
				
			Иначе 
				// очищаем если удаляют дату начала пропарки
				
				// не меняем если пропарка идет с прошлой смены
				// для исключения затирания по ошибке
				Если Не Стр.СостояниеНаНачало = Перечисления.алк_ОперацииПропарки.Пропарка Тогда
					Стр.ОкончаниеПропаркиПлан = '00010101'; 
				КонецЕсли;
				
				Стр.ОкончаниеПропаркиПланНаСледующуюСмену = '00010101';
				
			КонецЕсли;  
			
		Иначе
			
			Стр.ОкончаниеПропаркиПлан = '00010101';
			Стр.ОкончаниеПропаркиПланНаСледующуюСмену = '00010101'; 			
						
		КонецЕсли;  
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНормативЗагрузки() 
	
	ГрадацииДокумента = Объект.Камеры.Выгрузить(,"ГрадацияНаКонец").ВыгрузитьКолонку("ГрадацияНаКонец");
	   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
		|ПОМЕСТИТЬ ВТ_Сезон
		|ИЗ
		|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.Градация,
		|	алк_НормативыПропаркиСрезПоследних.Сезон,
		|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(
		|			&ДатаСреза,
		|			Градация В (&ГрадацииДокумента)
		|				И Сезон В
		|					(ВЫБРАТЬ
		|						ВТ_Сезон.Сезон
		|					ИЗ
		|						ВТ_Сезон КАК ВТ_Сезон)) КАК алк_НормативыПропаркиСрезПоследних";
	
	Запрос.УстановитьПараметр("ГрадацииДокумента", ГрадацииДокумента);
	Запрос.УстановитьПараметр("ДатаСреза", Объект.ДатаСмены);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого Стр Из Объект.Камеры Цикл 
		
		ГрадацияКамеры = Стр.ГрадацияНаКонец; 
		
		ОтборГрадация = Новый Структура;
		ОтборГрадация.Вставить("Градация", ГрадацияКамеры);
		
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(ОтборГрадация);	
		
		Если НайденныеСтроки.Количество() > 0 Тогда  
			
			Если ЗначениеЗаполнено(Стр.НачалоЗагрузки) Тогда 			
				
				ОкончаниеЗазрузкиПлан = Стр.НачалоЗагрузки + НайденныеСтроки[0].НормативЗагрузки * 3600;    
				
				НачалоТекущейСмены = Объект.ДатаСмены + ?(Объект.Смена = Перечисления.Смены.смена_8_20, 8*3600, 20*3600);
				ОкончаниеТекущейСмены = НачалоТекущейСмены + (12*3600 - 1);
				
				Если ОкончаниеЗазрузкиПлан < ОкончаниеТекущейСмены Тогда   
					// текущая смена  
					
					// не меняем если пропарка идет с прошлой смены
					// для исключения затирания по ошибке
					Если Не Стр.СостояниеНаНачало = Перечисления.алк_ОперацииПропарки.Загрузка Тогда
						Стр.ОкончаниеЗазрузкиПлан = ОкончаниеЗазрузкиПлан;
						Стр.ОкончаниеЗазрузкиПланНаСледующуюСмену = '00010101';				
					КонецЕсли;
					
				Иначе 
					// будущая смена
					Стр.ОкончаниеЗазрузкиПлан = '00010101';
					Стр.ОкончаниеЗазрузкиПланНаСледующуюСмену = ОкончаниеЗазрузкиПлан;
				КонецЕсли; 
				
			Иначе 
				// очищаем если удаляют дату начала пропарки
				
				// не меняем если пропарка идет с прошлой смены
				// для исключения затирания по ошибке
				Если Не Стр.СостояниеНаНачало = Перечисления.алк_ОперацииПропарки.Загрузка Тогда
					Стр.ОкончаниеЗазрузкиПлан = '00010101'; 
				КонецЕсли;
				
				Стр.ОкончаниеЗазрузкиПланНаСледующуюСмену = '00010101';
				
			КонецЕсли;
						
		КонецЕсли;  
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНормативРазгрузки() 
	
	ГрадацииДокумента = Объект.Камеры.Выгрузить(,"ГрадацияНаКонец").ВыгрузитьКолонку("ГрадацияНаКонец");
	   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
		|ПОМЕСТИТЬ ВТ_Сезон
		|ИЗ
		|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_НормативыПропаркиСрезПоследних.Градация,
		|	алк_НормативыПропаркиСрезПоследних.Сезон,
		|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
		|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
		|ИЗ
		|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(
		|			&ДатаСреза,
		|			Градация В (&ГрадацииДокумента)
		|				И Сезон В
		|					(ВЫБРАТЬ
		|						ВТ_Сезон.Сезон
		|					ИЗ
		|						ВТ_Сезон КАК ВТ_Сезон)) КАК алк_НормативыПропаркиСрезПоследних";
	
	Запрос.УстановитьПараметр("ГрадацииДокумента", ГрадацииДокумента);
	Запрос.УстановитьПараметр("ДатаСреза", Объект.ДатаСмены);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого Стр Из Объект.Камеры Цикл 
		
		ГрадацияКамеры = Стр.ГрадацияНаКонец; 
		
		ОтборГрадация = Новый Структура;
		ОтборГрадация.Вставить("Градация", ГрадацияКамеры);
		
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(ОтборГрадация);	
		
		Если НайденныеСтроки.Количество() > 0 Тогда  
			
			Если ЗначениеЗаполнено(Стр.НачалоРазгрузки) Тогда 			
				
				ОкончаниеРазгрузкиПлан = Стр.НачалоРазгрузки + НайденныеСтроки[0].НормативЗагрузки * 3600;    
				
				НачалоТекущейСмены = Объект.ДатаСмены + ?(Объект.Смена = Перечисления.Смены.смена_8_20, 8*3600, 20*3600);
				ОкончаниеТекущейСмены = НачалоТекущейСмены + (12*3600 - 1);
				
				Если ОкончаниеРазгрузкиПлан < ОкончаниеТекущейСмены Тогда   
					// текущая смена  
					
					// не меняем если пропарка идет с прошлой смены
					// для исключения затирания по ошибке
					Если Не Стр.СостояниеНаНачало = Перечисления.алк_ОперацииПропарки.Выгрузка Тогда
						Стр.ОкончаниеРазгрузкиПлан = ОкончаниеРазгрузкиПлан;
						Стр.ОкончаниеРазгрузкиПланНаСледующуюСмену = '00010101';				
					КонецЕсли;
					
				Иначе 
					// будущая смена
					Стр.ОкончаниеРазгрузкиПлан = '00010101';
					Стр.ОкончаниеРазгрузкиПланНаСледующуюСмену = ОкончаниеРазгрузкиПлан;
				КонецЕсли; 
				
			Иначе 
				// очищаем если удаляют дату начала пропарки
				
				// не меняем если пропарка идет с прошлой смены
				// для исключения затирания по ошибке
				Если Не Стр.СостояниеНаНачало = Перечисления.алк_ОперацииПропарки.Выгрузка Тогда
					Стр.ОкончаниеРазгрузкиПлан = '00010101'; 
				КонецЕсли;
				
				Стр.ОкончаниеРазгрузкиПланНаСледующуюСмену = '00010101';
				
			КонецЕсли;
						
		КонецЕсли;  
		
	КонецЦикла;
	
КонецПроцедуры

 
&НаКлиенте
Процедура КамерыПриИзменении(Элемент)
			
КонецПроцедуры

&НаСервере
Процедура РассчитатьПериодыОпераций()  
	
	Объект.ТаблицаДляДвижений.Очистить();  
	
	НачалоТекущейСмены = Объект.ДатаСмены + ?(Объект.Смена = Перечисления.Смены.смена_8_20, 8*3600, 20*3600);
	ОкончаниеТекущейСмены = НачалоТекущейСмены + (12*3600 - 1); 
		
	Для каждого Камера Из Объект.Камеры Цикл  
		
		// нужно расчитать время начала и конца каждой операции
		
		// Разгрузка  	
		ЗаполнитьПериодыОперации(
			Камера,
			Перечисления.алк_ОперацииПропарки.Выгрузка, 
			Камера.НачалоРазгрузки, 
			Камера.ОкончаниеРазгрузки,
			НачалоТекущейСмены, 
			ОкончаниеТекущейСмены,
			Ложь);
			
		ЗаполнитьПериодыОперации(
			Камера,
			Перечисления.алк_ОперацииПропарки.Выгрузка, 
			Камера.НачалоРазгрузки, 
			Камера.ОкончаниеРазгрузкиПлан,
			НачалоТекущейСмены, 
			ОкончаниеТекущейСмены,
			Истина);
			
			
		// Загрузка    	
		ЗаполнитьПериодыОперации(
			Камера,
			Перечисления.алк_ОперацииПропарки.Загрузка, 
			Камера.НачалоЗагрузки, 
			Камера.ОкончаниеЗазрузки,
			НачалоТекущейСмены, 
			ОкончаниеТекущейСмены,
			Ложь);
			
		ЗаполнитьПериодыОперации(
			Камера,
			Перечисления.алк_ОперацииПропарки.Загрузка, 
			Камера.НачалоЗагрузки, 
			Камера.ОкончаниеЗазрузкиПлан,
			НачалоТекущейСмены, 
			ОкончаниеТекущейСмены,
			Истина);
			
			
		// Пропарка         	
		ЗаполнитьПериодыОперации(
			Камера,
			Перечисления.алк_ОперацииПропарки.Пропарка, 
			Камера.НачалоПропарки, 
			Камера.ОкончаниеПропарки,
			НачалоТекущейСмены, 
			ОкончаниеТекущейСмены,
			Ложь); 
			
		ЗаполнитьПериодыОперации(
			Камера,
			Перечисления.алк_ОперацииПропарки.Пропарка, 
			Камера.НачалоПропарки, 
			Камера.ОкончаниеПропаркиПлан,
			НачалоТекущейСмены, 
			ОкончаниеТекущейСмены,
			Истина); 	
		
	
	КонецЦикла;	

	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодыОперации(Камера, Операция, НачалоОперации, КонецОперации, НачалоТекущейСмены, ОкончаниеТекущейСмены, План)  
	
	
	// нормальная разгрузка - начало в этой смене и окончание в этой смене
	Если ЗначениеЗаполнено(НачалоОперации) и НачалоОперации < КонецОперации  Тогда
		
		НоваяСтрока = Объект.ТаблицаДляДвижений.Добавить();
		
		НоваяСтрока.Камера 		= Камера.КамераСсылка; 
		НоваяСтрока.Бригада 	= Объект.Бригада;	
		НоваяСтрока.Состояние	= Операция;
		НоваяСтрока.План 		= План;
		
		НоваяСтрока.ВремяНачала 		= НачалоОперации;
		НоваяСтрока.ВремяОкончания 		= КонецОперации; 
		
		// продолжали разгружать прошлую смену, загрузили, пропарили, начали разгружать в этой смене но не разгрузили всё	
	ИначеЕсли ЗначениеЗаполнено(КонецОперации) И ЗначениеЗаполнено(НачалоОперации) Тогда
		
		НоваяСтрока = Объект.ТаблицаДляДвижений.Добавить();
		
		НоваяСтрока.Камера 		= Камера.КамераСсылка; 
		НоваяСтрока.Бригада 	= Объект.Бригада;	
		НоваяСтрока.Состояние	= Операция;
		НоваяСтрока.План 		= План;
		
		НоваяСтрока.ВремяНачала 		= НачалоТекущейСмены;
		НоваяСтрока.ВремяОкончания 		= КонецОперации;
		
		НоваяСтрока = Объект.ТаблицаДляДвижений.Добавить();
		
		НоваяСтрока.Камера 		= Камера.КамераСсылка; 
		НоваяСтрока.Бригада 	= Объект.Бригада;	
		НоваяСтрока.Состояние	= Операция;
		НоваяСтрока.План 		= План;
		
		НоваяСтрока.ВремяНачала 		= НачалоОперации;
		НоваяСтрока.ВремяОкончания 		= ОкончаниеТекущейСмены;
		
		// продолжали разгружать прошлую смену	
	ИначеЕсли ЗначениеЗаполнено(КонецОперации) Тогда
		
		НоваяСтрока = Объект.ТаблицаДляДвижений.Добавить();
		
		НоваяСтрока.Камера 		= Камера.КамераСсылка; 
		НоваяСтрока.Бригада 	= Объект.Бригада;	
		НоваяСтрока.Состояние	= Операция;
		НоваяСтрока.План 		= План;
		
		НоваяСтрока.ВремяНачала 		= НачалоТекущейСмены;
		НоваяСтрока.ВремяОкончания 		= КонецОперации;
		
		
		// начали разгружать в этой смене но не разгрузили всё	
	ИначеЕсли ЗначениеЗаполнено(НачалоОперации) Тогда
		
		НоваяСтрока = Объект.ТаблицаДляДвижений.Добавить();
		
		НоваяСтрока.Камера 		= Камера.КамераСсылка; 
		НоваяСтрока.Бригада 	= Объект.Бригада;	
		НоваяСтрока.Состояние	= Операция;
		НоваяСтрока.План 		= План;
		
		НоваяСтрока.ВремяНачала 		= НачалоОперации;
		НоваяСтрока.ВремяОкончания 		= ОкончаниеТекущейСмены;
		
		// пропарка может идти всю смену	
	ИначеЕсли Операция  = Перечисления.алк_ОперацииПропарки.Пропарка 
		И Камера.СостояниеНаНачало = Перечисления.алк_ОперацииПропарки.Пропарка Тогда 
		
		НоваяСтрока = Объект.ТаблицаДляДвижений.Добавить();
		
		НоваяСтрока.Камера 		= Камера.КамераСсылка; 
		НоваяСтрока.Бригада 	= Объект.Бригада;	
		НоваяСтрока.Состояние	= Операция;
		НоваяСтрока.План 		= План;
		
		НоваяСтрока.ВремяНачала 		= НачалоТекущейСмены;
		НоваяСтрока.ВремяОкончания 		= ОкончаниеТекущейСмены;
		
	КонецЕсли;
	
	
	
	

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНормативЗагрузки(Команда)
	
	Если Элементы.КамерыПоказатьНормативЗагрузки.Пометка Тогда 	
		Элементы.КамерыПоказатьНормативЗагрузки.Пометка = Ложь;	    		
	Иначе                                                       	
		Элементы.КамерыПоказатьНормативЗагрузки.Пометка = Истина;     
	КонецЕсли;	
	
	ПоказатьНормативЗагрузки = Элементы.КамерыПоказатьНормативЗагрузки.Пометка;
	Элементы.КамерыОкончаниеЗазрузкиПлан.Видимость = ПоказатьНормативЗагрузки;  
	
	Если ПоказатьНормативНаСледующуюСмену Тогда  	
		Элементы.КамерыОкончаниеЗазрузкиПланНаСледующуюСмену.Видимость 	= ПоказатьНормативЗагрузки;		
	Иначе		
		Элементы.КамерыОкончаниеЗазрузкиПланНаСледующуюСмену.Видимость 	= Ложь; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНормативПропарки(Команда)
	
	Если Элементы.КамерыПоказатьНормативПропарки.Пометка Тогда 	
		Элементы.КамерыПоказатьНормативПропарки.Пометка = Ложь;	   		
	Иначе                                                       	
		Элементы.КамерыПоказатьНормативПропарки.Пометка = Истина;			
	КонецЕсли; 
	
	ПоказатьНормативПропарки = Элементы.КамерыПоказатьНормативПропарки.Пометка;
	Элементы.КамерыОкончаниеПропаркиПлан.Видимость = ПоказатьНормативПропарки; 
	
	Если ПоказатьНормативНаСледующуюСмену Тогда 		
		Элементы.КамерыОкончаниеПропаркиПланНаСледующуюСмену.Видимость 	= ПоказатьНормативПропарки;  	
	Иначе
		Элементы.КамерыОкончаниеПропаркиПланНаСледующуюСмену.Видимость 	= Ложь;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНормативРазгрузки(Команда)
	
	Если Элементы.КамерыПоказатьНормативРазгрузки.Пометка Тогда 	
		Элементы.КамерыПоказатьНормативРазгрузки.Пометка = Ложь;	    		
	Иначе                                                       	
		Элементы.КамерыПоказатьНормативРазгрузки.Пометка = Истина;		   
	КонецЕсли;     
	
	ПоказатьНормативРазгрузки = Элементы.КамерыПоказатьНормативРазгрузки.Пометка;
	Элементы.КамерыОкончаниеРазгрузкиПлан.Видимость = ПоказатьНормативРазгрузки; 
	
	Если ПоказатьНормативНаСледующуюСмену Тогда 
		Элементы.КамерыОкончаниеРазгрузкиПланНаСледующуюСмену.Видимость = ПоказатьНормативРазгрузки; 	
	Иначе
		Элементы.КамерыОкончаниеРазгрузкиПланНаСледующуюСмену.Видимость = Ложь;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНормативСеледующейСмены(Команда)
	
	Если Элементы.КамерыПоказатьНормативСеледующейСмены.Пометка Тогда 	
		Элементы.КамерыПоказатьНормативСеледующейСмены.Пометка = Ложь;	    		
	Иначе                                                       	
		Элементы.КамерыПоказатьНормативСеледующейСмены.Пометка = Истина;		   
	КонецЕсли;
	
	ПоказатьНормативНаСледующуюСмену = Элементы.КамерыПоказатьНормативСеледующейСмены.Пометка; 
	
	Если ПоказатьНормативНаСледующуюСмену Тогда		
		Элементы.КамерыОкончаниеЗазрузкиПланНаСледующуюСмену.Видимость 	= ПоказатьНормативЗагрузки;
		Элементы.КамерыОкончаниеПропаркиПланНаСледующуюСмену.Видимость 	= ПоказатьНормативПропарки;
		Элементы.КамерыОкончаниеРазгрузкиПланНаСледующуюСмену.Видимость = ПоказатьНормативРазгрузки; 	
	Иначе                                                                               	
		Элементы.КамерыОкончаниеЗазрузкиПланНаСледующуюСмену.Видимость 	= Ложь;
		Элементы.КамерыОкончаниеПропаркиПланНаСледующуюСмену.Видимость 	= Ложь;
		Элементы.КамерыОкончаниеРазгрузкиПланНаСледующуюСмену.Видимость = Ложь;	   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Элементы.КамерыПоказатьНормативЗагрузки.Пометка 		= ПоказатьНормативЗагрузки;
	Элементы.КамерыПоказатьНормативПропарки.Пометка 		= ПоказатьНормативПропарки;
	Элементы.КамерыПоказатьНормативРазгрузки.Пометка 		= ПоказатьНормативРазгрузки;
    Элементы.КамерыПоказатьНормативСеледующейСмены.Пометка 	= ПоказатьНормативНаСледующуюСмену;

	
	Элементы.КамерыОкончаниеЗазрузкиПлан.Видимость 	= ПоказатьНормативЗагрузки;
	Элементы.КамерыОкончаниеПропаркиПлан.Видимость 	= ПоказатьНормативПропарки;
	Элементы.КамерыОкончаниеРазгрузкиПлан.Видимость = ПоказатьНормативРазгрузки;  
	
	Если ПоказатьНормативНаСледующуюСмену Тогда		
		Элементы.КамерыОкончаниеЗазрузкиПланНаСледующуюСмену.Видимость 	= ПоказатьНормативЗагрузки;
		Элементы.КамерыОкончаниеПропаркиПланНаСледующуюСмену.Видимость 	= ПоказатьНормативПропарки;
		Элементы.КамерыОкончаниеРазгрузкиПланНаСледующуюСмену.Видимость = ПоказатьНормативРазгрузки; 	
	Иначе                                                                               	
		Элементы.КамерыОкончаниеЗазрузкиПланНаСледующуюСмену.Видимость 	= Ложь;
		Элементы.КамерыОкончаниеПропаркиПланНаСледующуюСмену.Видимость 	= Ложь;
		Элементы.КамерыОкончаниеРазгрузкиПланНаСледующуюСмену.Видимость = Ложь;	   
	КонецЕсли; 
	
	Если ЕстьПолныеПрава() Тогда
		Элементы.ГруппаДвижения.Видимость = Истина;
	Иначе
		Элементы.ГруппаДвижения.Видимость = Ложь;			
	КонецЕсли;
	
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ЕстьПолныеПрава()
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции // ()

&НаКлиенте
Процедура КамерыРазгрузилиОбъемПриИзменении(Элемент)
	
    СтрокаТЧ = Элементы.Камеры.ТекущиеДанные;
    СтрокаТЧ.ОстатокНаКонецСмены = СтрокаТЧ.ОстатокНаНачалоСмены - СтрокаТЧ.РазгрузилиОбъем + СтрокаТЧ.ЗагрузкаОбъем; 
	
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать


#КонецОбласти
